'''
5. Создать список, содержащий цены на товары (10–20 товаров), например:
[57.8, 46.51, 97, ...]
Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в виде <r> руб <kk> коп (например «5 руб 04 коп»).
Подумать, как из цены получить рубли и копейки, как добавить нули, если, например, получилось 7 копеек или 0 копеек (должно быть 07 коп или 00 коп).
Вывести цены, отсортированные по возрастанию, новый список не создавать (доказать, что объект списка после сортировки остался тот же).
Создать новый список, содержащий те же цены, но отсортированные по убыванию.
Вывести цены пяти самых дорогих товаров. Сможете ли вы вести цены этих товаров по возрастанию, написав минимум кода?
'''
my_list = [2.34, 57.8, 46.51, 97, 11.33, 22.44, 33.44, 44.55, 55.66, 77.66, 88.9, 10.5]

my_list2 = []
for i in my_list:
    r = int(i // 1)
    kk = round(i % r * 100)
    my_list2.append(f'{r:02d} руб {kk:02d} коп')

my_str = ', '.join(my_list2)
print('Строка с ценами через запятую:', my_str)

print('Cписок № 2:               ', id(my_list2), my_list2)


my_list2.sort()
print('Отсортированый список № 2:', id(my_list2), my_list2)

my_new_list = my_list2[::-1]
print('Новый список:             ', id(my_new_list), my_new_list)

print('5 самых дорогих товаров (цена по возростанию):', my_new_list[:-5])
